title: Privilege Escalation via Sudo
id: bb62dcef-0842-57f0-8597-b95848b380f2
status: stable
description: Detects privilege escalation attempts using sudo
author: SecurityScarletAI
date: 2026/05/03
logsource:
    category: authentication
detection:
    selection:
        event_type: start
        event_action|contains: privilege
        process_name: sudo
    condition: selection
level: medium
tags:
    - attack.privilege_escalation
    - attack.ta0004
    - attack.t1548