title: Service Account Anomaly
id: c3078ce9-b15f-55a0-88ee-8eb6727f8731
status: experimental
description: Detects authentication events from service accounts outside of normal patterns
author: SecurityScarletAI
date: 2026/05/03
logsource:
    category: authentication
detection:
    selection:
        event_type: start
        event_action|contains: success
        user_name|contains: svc
    condition: selection
level: low
tags:
    - attack.initial_access
    - attack.ta0001
    - attack.t1078