title: Suspicious DNS Query
id: ce4166ef-5180-551a-ac2a-2389f2b96b89
status: stable
description: Detects DNS queries to suspicious or known-malicious domains
author: SecurityScarletAI
date: 2026/05/03
logsource:
    category: network
detection:
    selection:
        event_type: start
        event_action|contains: dns
        destination_port: 53
    condition: selection
level: low
tags:
    - attack.command_and_control
    - attack.ta0011
    - attack.t1071