title: LaunchDaemon Persistence Created
id: 07647db1-6c5b-50a4-a82a-b6be38501b5f
status: stable
description: Detects creation of macOS LaunchDaemon plist files, often used for privilege persistence
author: SecurityScarletAI
date: 2026/05/03
logsource:
    category: file
detection:
    selection:
        event_type: start
        file_path|contains: LaunchDaemons
    condition: selection
level: critical
tags:
    - attack.persistence
    - attack.ta0003
    - attack.t1547