title: Safari Extension Installation
id: db93ca8b-8119-5621-9b65-2fa160c8dc93
status: stable
description: Detects installation of browser extensions in Safari, which can be used for persistence and data theft
author: SecurityScarletAI
date: 2026/05/03
logsource:
    category: file
detection:
    selection:
        event_type: start
        file_path|contains: Safari/Extensions
    condition: selection
level: medium
tags:
    - attack.persistence
    - attack.ta0003
    - attack.t1176